---

C#Visual BasicVisual C++

Include Protected MembersInclude Inherited Members

Revit 2024 API
---
FamilySizeTableManager Properties
FamilySizeTableManager Class See Also Send Feedback
---

The FamilySizeTableManager type exposes the following members.

# Properties

|  | Name | Description |
| --- | --- | --- |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | NumberOfSizeTables | The number of FamilySizeTables in a family. |

# See Also

FamilySizeTableManager Class

Autodesk.Revit.DB Namespace